In [3]:
import pandas as pd

In [4]:
# Reference: Import data from Yahoo Finance - https://finance.yahoo.com/quote/CSV/history/?guccounter=1&period1=1356998400&period2=1703980800
# Asset name: Carriage Services, Inc. (CSV)
# Currency: USD (United  State Dollar)
df = pd.read_csv("finance.yahoo.com 2013-2023.csv")

In [5]:
# Display the count of columns and rows
df.shape

(2768, 7)

In [6]:
# Display the records
df.head()

         Date   Open   High    Low  Close  Adj Close  Volume
0  2013-01-02  11.91  13.52  11.90  13.45  11.948698  208100
1  2013-01-03  13.55  13.59  12.87  12.90  11.460092  106000
2  2013-01-04  12.99  13.25  12.48  13.22  11.744374   54800
3  2013-01-07  13.15  13.22  13.00  13.05  11.593348   33300
4  2013-01-08  13.05  13.25  12.96  13.00  11.548930   31700

In [7]:
# Display the duplicates rows
df.duplicated().sum()

0

In [8]:
# Display the missing values
df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [9]:
# Print a concise summary of a DataFrame.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2768 entries, 0 to 2767
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2768 non-null   object
 1   Open       2768 non-null   float64
 2   High       2768 non-null   float64
 3   Low        2768 non-null   float64
 4   Close      2768 non-null   float64
 5   Adj Close  2768 non-null   float64
 6   Volume     2768 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 151.5+ KB

In [10]:
# assign only column Date and Close to our dataframe object
df = df[['Date','Close']]
df.head()

         Date  Close
0  2013-01-02  13.45
1  2013-01-03  12.90
2  2013-01-04  13.22
3  2013-01-07  13.05
4  2013-01-08  13.00

In [11]:
# Convert the 'Date' column to datetime format
df.loc[:, 'Date'] = pd.to_datetime(df['Date'])

# Set 'Date' column as the index
df.set_index('Date', inplace=True)